/* automatically generated by rust-bindgen 0.71.1 */

use super::fetchdecode::last_opcode;

pub const BX_PREPARE_AMX: u32 = 2048;
pub const BX_PREPARE_EVEX: u32 = 128;
pub const BX_PREPARE_OPMASK: u32 = 64;
pub const BX_PREPARE_AVX: u32 = 32;
pub const BX_PREPARE_SSE: u32 = 16;
pub const BX_PREPARE_MMX: u32 = 8;
pub const BX_PREPARE_FPU: u32 = 4;
pub const BX_LOCKABLE: u32 = 2;
pub const BX_TRACE_END: u32 = 1;
pub const SSE_PREFIX_NONE: SsePrefix = SsePrefix::PrefixNone;
pub const SSE_PREFIX_66: SsePrefix = SsePrefix::Prefix66;
pub const SSE_PREFIX_F3: SsePrefix = SsePrefix::PrefixF3;
pub const SSE_PREFIX_F2: SsePrefix = SsePrefix::PrefixF2;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SsePrefix {
    PrefixNone = 0,
    Prefix66 = 1,
    PrefixF3 = 2,
    PrefixF2 = 3,
}
//#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq, thiserror::Error)]
pub enum BxDecodeError {
    BxDecodeOk = 0,
    BxIllegalOpcode = 1,
    BxIllegalLockPrefix = 2,
    BxIllegalVexXopVvv = 3,
    BxIllegalVexXopWithSsePrefix = 4,
    BxIllegalVexXopWithRexPrefix = 5,
    BxIllegalVexXopOpcodeMap = 6,
    BxVexXopBadVectorLength = 7,
    BxVsibForbiddenAsize16 = 8,
    BxVsibIllegalSibIndex = 9,
    BxEvexReservedBitsSet = 10,
    BxEvexIllegalEvexBSaeNotAllowed = 11,
    BxEvexIllegalEvexBBroadcastNotAllowed = 12,
    BxEvexIllegalKmaskRegister = 13,
    BxEvexIllegalZeroMaskingWithKmaskSrcOrDest = 14,
    BxEvexIllegalZeroMaskingVsib = 15,
    BxEvexIllegalZeroMaskingMemoryDestination = 16,
    BxAmxIllegalTileRegister = 17,
    Other,
    NoMoreLen,
    U32toUsize,
    Ud32,
    ModRmParseFail,
    ThreeDNow,

    DecodeModrm32,
    ParseModrm32,
}

impl Default for BxDecodeError {
    fn default() -> Self {
        Self::BxVsibIllegalSibIndex
    }
}

pub const BX_SRC_NONE: BxSrc = BxSrc::BxSrcNone;
pub const BX_SRC_EAX: BxSrc = BxSrc::BxSrcEax;
pub const BX_SRC_NNN: BxSrc = BxSrc::BxSrcNnn;
pub const BX_SRC_RM: BxSrc = BxSrc::BxSrcRm;
pub const BX_SRC_VECTOR_RM: BxSrc = BxSrc::BxSrcVectorRm;
pub const BX_SRC_VVV: BxSrc = BxSrc::BxSrcVvv;
pub const BX_SRC_VIB: BxSrc = BxSrc::BxSrcVib;
pub const BX_SRC_VSIB: BxSrc = BxSrc::BxSrcVsib;
pub const BX_SRC_IMM: BxSrc = BxSrc::BxSrcImm;
pub const BX_SRC_BRANCH_OFFSET: BxSrc = BxSrc::BxSrcBranchOffset;
pub const BX_SRC_IMPLICIT: BxSrc = BxSrc::BxSrcImplicit;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BxSrc {
    BxSrcNone = 0,
    BxSrcEax = 1,
    BxSrcNnn = 2,
    BxSrcRm = 3,
    BxSrcVectorRm = 4,
    BxSrcVvv = 5,
    BxSrcVib = 6,
    BxSrcVsib = 7,
    BxSrcImm = 8,
    BxSrcBranchOffset = 9,
    BxSrcImplicit = 10,
}

impl Default for BxSrc {
    fn default() -> Self {
        Self::BxSrcRm
    }
}
pub const BX_NO_REGISTER: ForDisasm = ForDisasm::BxNoRegister;
pub const BX_GPR8: ForDisasm = ForDisasm::BxGpr8;
pub const BX_GPR16: ForDisasm = ForDisasm::BxGpr16;
pub const BX_GPR32: ForDisasm = ForDisasm::BxGpr32;
pub const BX_GPR64: ForDisasm = ForDisasm::BxGpr64;
pub const BX_FPU_REG: ForDisasm = ForDisasm::BxFpuReg;
pub const BX_MMX_REG: ForDisasm = ForDisasm::BxMmxReg;
pub const BX_MMX_HALF_REG: ForDisasm = ForDisasm::BxMmxHalfReg;
pub const BX_VMM_REG: ForDisasm = ForDisasm::BxVmmReg;
pub const BX_KMASK_REG: ForDisasm = ForDisasm::BxKmaskReg;
pub const BX_KMASK_REG_PAIR: ForDisasm = ForDisasm::BxKmaskRegPair;
pub const BX_TMM_REG: ForDisasm = ForDisasm::BxTmmReg;
pub const BX_SEGREG: ForDisasm = ForDisasm::BxSegreg;
pub const BX_CREG: ForDisasm = ForDisasm::BxCreg;
pub const BX_DREG: ForDisasm = ForDisasm::BxDreg;

// for disasm:
// when the source is register, indicates the register type and size
// when the source is memory reference, give hint about the memory access size
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ForDisasm {
    BxNoRegister = 0,
    BxGpr8 = 1,
    BxGpr16 = 2,
    BxGpr32 = 3,
    BxGpr64 = 4,
    BxFpuReg = 5,
    BxMmxReg = 6,
    BxMmxHalfReg = 7,
    BxVmmReg = 8,
    BxKmaskReg = 9,
    BxKmaskRegPair = 10,
    BxTmmReg = 11,
    BxSegreg = 12,
    BxCreg = 13,
    BxDreg = 14,
}
pub const BX_VMM_FULL_VECTOR: _bindgen_ty_4 = _bindgen_ty_4::BxVmmFullVector;
pub const BX_VMM_FULL_VECTOR_W: _bindgen_ty_4 = _bindgen_ty_4::BxVmmFullVectorW;
pub const BX_VMM_SCALAR_BYTE: _bindgen_ty_4 = _bindgen_ty_4::BxVmmScalarByte;
pub const BX_VMM_SCALAR_WORD: _bindgen_ty_4 = _bindgen_ty_4::BxVmmScalarWord;
pub const BX_VMM_SCALAR_DWORD: _bindgen_ty_4 = _bindgen_ty_4::BxVmmScalarDword;
pub const BX_VMM_SCALAR_QWORD: _bindgen_ty_4 = _bindgen_ty_4::BxVmmScalarQword;
pub const BX_VMM_SCALAR: _bindgen_ty_4 = _bindgen_ty_4::BxVmmScalar;
pub const BX_VMM_HALF_VECTOR: _bindgen_ty_4 = _bindgen_ty_4::BxVmmHalfVector;
pub const BX_VMM_HALF_VECTOR_W: _bindgen_ty_4 = _bindgen_ty_4::BxVmmHalfVectorW;
pub const BX_VMM_QUARTER_VECTOR: _bindgen_ty_4 = _bindgen_ty_4::BxVmmQuarterVector;
pub const BX_VMM_QUARTER_VECTOR_W: _bindgen_ty_4 = _bindgen_ty_4::BxVmmQuarterVectorW;
pub const BX_VMM_EIGHTH_VECTOR: _bindgen_ty_4 = _bindgen_ty_4::BxVmmEighthVector;
pub const BX_VMM_VEC128: _bindgen_ty_4 = _bindgen_ty_4::BxVmmVec128;
pub const BX_VMM_VEC256: _bindgen_ty_4 = _bindgen_ty_4::BxVmmVec256;

// to be used together with BX_SRC_VECTOR_RM
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_4 {
    BxVmmFullVector = 0,
    BxVmmFullVectorW = 1,
    BxVmmScalarByte = 2,
    BxVmmScalarWord = 3,
    BxVmmScalarDword = 4,
    BxVmmScalarQword = 5,
    BxVmmScalar = 6,
    BxVmmHalfVector = 7,
    BxVmmHalfVectorW = 8,
    BxVmmQuarterVector = 9,
    BxVmmQuarterVectorW = 10,
    BxVmmEighthVector = 11,
    BxVmmVec128 = 12,
    BxVmmVec256 = 13,
}
pub const BX_IMM1: BxImmediateForm = BxImmediateForm::IMM1;
pub const BX_IMMB: BxImmediateForm = BxImmediateForm::IMMB;
pub const BX_IMMBW_SE: BxImmediateForm = BxImmediateForm::ImmbwSe;
pub const BX_IMMBD_SE: BxImmediateForm = BxImmediateForm::ImmbdSe;
pub const BX_IMMW: BxImmediateForm = BxImmediateForm::IMMW;
pub const BX_IMMD: BxImmediateForm = BxImmediateForm::IMMD;
pub const BX_IMMQ: BxImmediateForm = BxImmediateForm::IMMQ;
pub const BX_IMMB2: BxImmediateForm = BxImmediateForm::IMMB2;
pub const BX_DIRECT_PTR: BxImmediateForm = BxImmediateForm::DirectPtr;
pub const BX_DIRECT_MEMREF_B: BxImmediateForm = BxImmediateForm::DirectMemrefB;
pub const BX_DIRECT_MEMREF_W: BxImmediateForm = BxImmediateForm::DirectMemrefW;
pub const BX_DIRECT_MEMREF_D: BxImmediateForm = BxImmediateForm::DirectMemrefD;
pub const BX_DIRECT_MEMREF_Q: BxImmediateForm = BxImmediateForm::DirectMemrefQ;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BxImmediateForm {
    IMM1 = 1,
    IMMB = 2,
    ImmbwSe = 3,
    ImmbdSe = 4,
    IMMW = 5,
    IMMD = 6,
    IMMQ = 7,
    IMMB2 = 8,
    DirectPtr = 9,
    DirectMemrefB = 12,
    DirectMemrefW = 13,
    DirectMemrefD = 14,
    DirectMemrefQ = 15,
}
pub const BX_RSIREF_B: ImplicitRegOrMemAccesses = ImplicitRegOrMemAccesses::RsirefB;
pub const BX_RSIREF_W: ImplicitRegOrMemAccesses = ImplicitRegOrMemAccesses::RsirefW;
pub const BX_RSIREF_D: ImplicitRegOrMemAccesses = ImplicitRegOrMemAccesses::RsirefD;
pub const BX_RSIREF_Q: ImplicitRegOrMemAccesses = ImplicitRegOrMemAccesses::RsirefQ;
pub const BX_RDIREF_B: ImplicitRegOrMemAccesses = ImplicitRegOrMemAccesses::RdirefB;
pub const BX_RDIREF_W: ImplicitRegOrMemAccesses = ImplicitRegOrMemAccesses::RdirefW;
pub const BX_RDIREF_D: ImplicitRegOrMemAccesses = ImplicitRegOrMemAccesses::RdirefD;
pub const BX_RDIREF_Q: ImplicitRegOrMemAccesses = ImplicitRegOrMemAccesses::RdirefQ;
pub const BX_MMX_RDIREF: ImplicitRegOrMemAccesses = ImplicitRegOrMemAccesses::MmxRdiref;
pub const BX_VEC_RDIREF: ImplicitRegOrMemAccesses = ImplicitRegOrMemAccesses::VecRdiref;
pub const BX_USECL: ImplicitRegOrMemAccesses = ImplicitRegOrMemAccesses::USECL;
pub const BX_USEDX: ImplicitRegOrMemAccesses = ImplicitRegOrMemAccesses::USEDX;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ImplicitRegOrMemAccesses {
    RsirefB = 1,
    RsirefW = 2,
    RsirefD = 3,
    RsirefQ = 4,
    RdirefB = 5,
    RdirefW = 6,
    RdirefD = 7,
    RdirefQ = 8,
    MmxRdiref = 9,
    VecRdiref = 10,
    USECL = 11,
    USEDX = 12,
}
pub const OP_NONE: u8 = 0;
pub const OP_EB: u8 = 19;
pub const OP_EW: u8 = 35;
pub const OP_ED: u8 = 51;
pub const OP_EQ: u8 = 67;
pub const OP_GB: u8 = 18;
pub const OP_GW: u8 = 34;
pub const OP_GD: u8 = 50;
pub const OP_GQ: u8 = 66;
pub const OP_ALREG: u8 = 17;
pub const OP_AXREG: u8 = 33;
pub const OP_EAXREG: u8 = 49;
pub const OP_RAXREG: u8 = 65;
pub const OP_CLREG: u8 = 186;
pub const OP_DXREG: u8 = 202;
pub const OP_I1: u8 = 24;
pub const OP_IB: u8 = 40;
pub const OP_S_IBW: u8 = 56;
pub const OP_S_IBD: u8 = 72;
pub const OP_IW: u8 = 88;
pub const OP_ID: u8 = 104;
pub const OP_S_ID: u8 = 104;
pub const OP_IQ: u8 = 120;
pub const OP_IB2: u8 = 136;
pub const OP_JW: u8 = 89;
pub const OP_JD: u8 = 105;
pub const OP_JQ: u8 = 105;
pub const OP_JBW: u8 = 57;
pub const OP_JBD: u8 = 73;
pub const OP_JBQ: u8 = 73;
pub const OP_M: u8 = 3;
pub const OP_MT: u8 = 83;
pub const OP_MDQ: u8 = 4;
pub const OP_MB: u8 = 19;
pub const OP_MW: u8 = 35;
pub const OP_MD: u8 = 51;
pub const OP_MQ: u8 = 67;
pub const OP_PQ: u8 = 98;
pub const OP_QD: u8 = 115;
pub const OP_QQ: u8 = 99;
pub const OP_VDQ: u8 = 130;
pub const OP_VQQ: u8 = 130;
pub const OP_VPH: u8 = 130;
pub const OP_VPS: u8 = 130;
pub const OP_VPD: u8 = 130;
pub const OP_VSH: u8 = 130;
pub const OP_VSS: u8 = 130;
pub const OP_VSD: u8 = 130;
pub const OP_VQ: u8 = 130;
pub const OP_VD: u8 = 130;
pub const OP_WQ: u8 = 84;
pub const OP_WD: u8 = 68;
pub const OP_WW: u8 = 52;
pub const OP_WB: u8 = 36;
pub const OP_WDQ: u8 = 4;
pub const OP_WPH: u8 = 4;
pub const OP_WPS: u8 = 4;
pub const OP_WPD: u8 = 4;
pub const OP_WSH: u8 = 52;
pub const OP_WSS: u8 = 68;
pub const OP_WSD: u8 = 84;
pub const OP_M_VPH: u8 = 20;
pub const OP_M_VPS: u8 = 4;
pub const OP_M_VPD: u8 = 4;
pub const OP_M_VPH16: u8 = 52;
pub const OP_M_VPS32: u8 = 68;
pub const OP_M_VPD64: u8 = 84;
pub const OP_M_VDQ: u8 = 4;
pub const OP_M_VQQQ: u8 = 4;
pub const OP_M_VSH: u8 = 52;
pub const OP_M_VSS: u8 = 68;
pub const OP_M_VSD: u8 = 84;
pub const OP_M_VDQ88: u8 = 36;
pub const OP_M_VDQ16: u8 = 52;
pub const OP_M_VDQ32: u8 = 68;
pub const OP_M_VDQ64: u8 = 84;
pub const OP_M_VHV: u8 = 116;
pub const OP_M_VHVW: u8 = 132;
pub const OP_M_VQV: u8 = 148;
pub const OP_M_VQVW: u8 = 164;
pub const OP_M_VOV: u8 = 180;
pub const OP_M_VDQ128: u8 = 196;
pub const OP_M_VDQ256: u8 = 212;
pub const OP_VSIB: u8 = 103;
pub const OP_HDQ: u8 = 133;
pub const OP_HPH: u8 = 133;
pub const OP_HPS: u8 = 133;
pub const OP_HPD: u8 = 133;
pub const OP_HSH: u8 = 133;
pub const OP_HSS: u8 = 133;
pub const OP_HSD: u8 = 133;
pub const OP_BD: u8 = 53;
pub const OP_BQ: u8 = 69;
pub const OP_VIB: u8 = 134;
pub const OP_CD: u8 = 210;
pub const OP_CQ: u8 = 210;
pub const OP_DD: u8 = 226;
pub const OP_DQ: u8 = 226;
pub const OP_SW: u8 = 194;
pub const OP_OB: u8 = 200;
pub const OP_OW: u8 = 216;
pub const OP_OD: u8 = 232;
pub const OP_OQ: u8 = 248;
pub const OP_AP: u8 = 152;
pub const OP_KGB: u8 = 146;
pub const OP_KEB: u8 = 147;
pub const OP_KHB: u8 = 149;
pub const OP_KGW: u8 = 146;
pub const OP_KEW: u8 = 147;
pub const OP_KHW: u8 = 149;
pub const OP_KGD: u8 = 146;
pub const OP_KED: u8 = 147;
pub const OP_KHD: u8 = 149;
pub const OP_KGQ: u8 = 146;
pub const OP_KEQ: u8 = 147;
pub const OP_KHQ: u8 = 149;
pub const OP_KGQ2: u8 = 162;
pub const OP_TRM: u8 = 179;
pub const OP_TNNN: u8 = 178;
pub const OP_TREG: u8 = 181;
pub const OP_ST0: u8 = 81;
pub const OP_STI: u8 = 83;
pub const OP_XB: u8 = 26;
pub const OP_XW: u8 = 42;
pub const OP_XD: u8 = 58;
pub const OP_XQ: u8 = 74;
pub const OP_YB: u8 = 90;
pub const OP_YW: u8 = 106;
pub const OP_YD: u8 = 122;
pub const OP_YQ: u8 = 138;
pub const OP_S_YQ: u8 = 154;
pub const OP_S_YDQ: u8 = 170;
#[repr(C)]
#[derive(Debug, Copy, Clone, Default)]
pub struct BxModrm {
    pub modrm: u32,
    pub mod_: u32,
    pub nnn: u32,
    pub rm: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bx_modrm"][::core::mem::size_of::<BxModrm>() - 16usize];
    ["Alignment of bx_modrm"][::core::mem::align_of::<BxModrm>() - 4usize];
    ["Offset of field: bx_modrm::modrm"][::core::mem::offset_of!(BxModrm, modrm) - 0usize];
    ["Offset of field: bx_modrm::mod_"][::core::mem::offset_of!(BxModrm, mod_) - 4usize];
    ["Offset of field: bx_modrm::nnn"][::core::mem::offset_of!(BxModrm, nnn) - 8usize];
    ["Offset of field: bx_modrm::rm"][::core::mem::offset_of!(BxModrm, rm) - 12usize];
};
pub const OS64_OFFSET: u32 = 23;
pub const OS32_OFFSET: u32 = 22;
pub const AS64_OFFSET: u32 = 21;
pub const AS32_OFFSET: u32 = 20;
pub const SSE_PREFIX_F2_F3_OFFSET: u32 = 19;
pub const SSE_PREFIX_OFFSET: u32 = 18;
pub const LOCK_PREFIX_OFFSET: u32 = 17;
pub const MODC0_OFFSET: u32 = 16;
pub const IS64_OFFSET: u32 = 15;
pub const VEX_OFFSET: u32 = 14;
pub const EVEX_OFFSET: u32 = 13;
pub const XOP_OFFSET: u32 = 12;
pub const VEX_VL_512_OFFSET: u32 = 11;
pub const VEX_VL_128_256_OFFSET: u32 = 10;
pub const VEX_W_OFFSET: u32 = 9;
pub const MASK_K0_OFFSET: u32 = 8;
pub const SRC_EQ_DST_OFFSET: u32 = 7;
pub const RRR_OFFSET: u32 = 4;
pub const NNN_OFFSET: u32 = 0;
pub const ATTR_OS64: u64 = 211106245115904;
pub const ATTR_OS32: u64 = 70368756760576;
pub const ATTR_OS16: u64 = 12582912;
pub const ATTR_OS16_32: u64 = 8388608;
pub const ATTR_OS32_64: u64 = 70368748371968;
pub const ATTR_AS64: u64 = 52776561278976;
pub const ATTR_AS32: u64 = 17592189190144;
pub const ATTR_AS16: u64 = 3145728;
pub const ATTR_AS16_32: u64 = 2097152;
pub const ATTR_AS32_64: u64 = 17592187092992;
pub const ATTR_IS32: u64 = 32768;
pub const ATTR_IS64: u64 = 549755846656;
pub const ATTR_SSE_NO_PREFIX: u64 = 786432;
pub const ATTR_SSE_PREFIX_66: u64 = 4398047297536;
pub const ATTR_SSE_PREFIX_F3: u64 = 8796093808640;
pub const ATTR_SSE_PREFIX_F2: u64 = 13194140319744;
pub const ATTR_NO_SSE_PREFIX_F2_F3: u64 = 524288;
pub const ATTR_LOCK_PREFIX_NOT_ALLOWED: u64 = 131072;
pub const ATTR_LOCK: u64 = 2199023386624;
pub const ATTR_MODC0: u64 = 1099511693312;
pub const ATTR_NO_MODC0: u64 = 65536;
pub const ATTR_MOD_REG: u64 = 1099511693312;
pub const ATTR_MOD_MEM: u64 = 65536;
pub const ATTR_VEX: u64 = 274877923328;
pub const ATTR_EVEX: u64 = 137438961664;
pub const ATTR_XOP: u64 = 68719480832;
pub const ATTR_VL128: u64 = 3072;
pub const ATTR_VL256: u64 = 17179872256;
pub const ATTR_VL512: u64 = 51539610624;
pub const ATTR_VL256_512: u64 = 17179870208;
pub const ATTR_VL128_256: u64 = 2048;
pub const ATTR_VEX_L0: u64 = 3072;
pub const ATTR_VEX_W0: u64 = 512;
pub const ATTR_VEX_W1: u64 = 8589935104;
pub const ATTR_NO_VEX_EVEX_XOP: u64 = 12288;
pub const ATTR_MASK_K0: u64 = 4294967552;
pub const ATTR_MASK_REQUIRED: u64 = 256;
pub const ATTR_SRC_EQ_DST: u64 = 1101659177088;
pub const ATTR_RRR0: u64 = 112;
pub const ATTR_RRR1: u64 = 268435568;
pub const ATTR_RRR2: u64 = 536871024;
pub const ATTR_RRR3: u64 = 805306480;
pub const ATTR_RRR4: u64 = 1073741936;
pub const ATTR_RRR5: u64 = 1342177392;
pub const ATTR_RRR6: u64 = 1610612848;
pub const ATTR_RRR7: u64 = 1879048304;
pub const ATTR_NNN0: u64 = 7;
pub const ATTR_NNN1: u64 = 16777223;
pub const ATTR_NNN2: u64 = 33554439;
pub const ATTR_NNN3: u64 = 50331655;
pub const ATTR_NNN4: u64 = 67108871;
pub const ATTR_NNN5: u64 = 83886087;
pub const ATTR_NNN6: u64 = 100663303;
pub const ATTR_NNN7: u64 = 117440519;
unsafe extern "C" {
    pub static ATTR_LAST_OPCODE: u64;
}

// TODO: It seems to be wrong
pub const BxOpcodeGroup_ERR: [u64; 1] = [last_opcode(0, super::ia_opcodes::Opcode::IaError)];
